АлогистикТест2/src/Documents/алк_НормыРасходаИВыпуска/алк_НормыРасходаИВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_НормыРасходаИВыпуска</name>
  <registerRecords>InformationRegister.алк_НормыРасходаИВыпуска</registerRecords>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияE</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияM</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭмиссияF</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркаАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адгезия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдгезияАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прочность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЭффективногоПоперечногоСечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Нормы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.алк_ВидДвиженияНормы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистовСорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистовВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КРС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗависимости</name>
      <type>
        <types>EnumRef.алк_ВариантыЗависимостиНормы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидДвиженияНормы/алк_ВидДвиженияНормы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидДвиженияНормы</name>
  <enumValues>
    <name>Материалы</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/алк_ОперацииПроизводства/алк_ОперацииПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>алк_ОперацииПроизводства</name>
  <predefined>
    <items>
      <name>Досушка</name>
      <description>Досушка</description>
    </items>
    <items>
      <name>Дробление</name>
      <description>Дробление</description>
    </items>
    <items>
      <name>Лущение</name>
      <description>Лущение</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Отгрузка</name>
      <description>Отгрузка</description>
    </items>
    <items>
      <name>ОтгрузкаСудна</name>
      <description>Отгрузка судна</description>
    </items>
    <items>
      <name>ПереданоВОтгрузку</name>
      <description>Передано в отгрузку</description>
    </items>
    <items>
      <name>ПеремещениеПриход</name>
      <description>Перемещение приход</description>
    </items>
    <items>
      <name>ПеремещениеРасход</name>
      <description>Перемещение расход</description>
    </items>
    <items>
      <name>Пересортица</name>
      <description>Пересортица</description>
    </items>
    <items>
      <name>Переупаковка</name>
      <description>Переупаковка</description>
    </items>
    <items>
      <name>Прибыло</name>
      <description>Прибыло</description>
    </items>
    <items>
      <name>Приемка</name>
      <description>Приемка</description>
    </items>
    <items>
      <name>ПриемкаВПорту</name>
      <description>Приемка в порту</description>
    </items>
    <items>
      <name>ПриемкаПоГОСТ</name>
      <description>Приемка по ГОСТ</description>
    </items>
    <items>
      <name>ПроизводствоПоддонов</name>
      <description>Производство поддонов</description>
    </items>
    <items>
      <name>ПроизводствоТопливныхБрикетов</name>
      <description>Производство топливных брикетов</description>
    </items>
    <items>
      <name>ПроизводствоФанеры</name>
      <description>Производство фанеры</description>
    </items>
    <items>
      <name>Разгружено</name>
      <description>Разгружено</description>
    </items>
    <items>
      <name>Распил</name>
      <description>Распил</description>
    </items>
    <items>
      <name>Ребросклей</name>
      <description>Ребросклей</description>
    </items>
    <items>
      <name>РучнаяСортировка</name>
      <description>Ручная сортировка</description>
    </items>
    <items>
      <name>СборкаРазборкаПакета</name>
      <description>Сборка/Разборка пакета</description>
    </items>
    <items>
      <name>Списание</name>
      <description>Списание</description>
    </items>
    <items>
      <name>Сушка</name>
      <description>Сушка</description>
    </items>
    <items>
      <name>Упаковка</name>
      <description>Упаковка</description>
    </items>
    <items>
      <name>УпаковкаФанеры</name>
      <description>Упаковка фанеры</description>
    </items>
    <items>
      <name>ФорматнаяОбрезка</name>
      <description>Форматная обрезка</description>
    </items>
    <items>
      <name>ЧисленныйСоставСмены</name>
      <description>Численный состав смены (общая)</description>
    </items>
    <items>
      <name>ШлифованиеФанеры</name>
      <description>Шлифование фанеры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗапросПолученияБюджета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияПлана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПолученияФакта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперацииДляЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>63</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИтогов</name>
    <type>
      <types>EnumRef.алк_ВариантыИтогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависитОтОпераций</name>
    <comment>Используется в механизме расчета показателей для настраиваемых отчетов</comment>
    <attributes>
      <name>ОперацияПроизводства</name>
      <type>
        <types>CatalogRef.алк_ОперацииПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользуемыеВТ</name>
    <attributes>
      <name>ВТ</name>
      <type>
        <types>CatalogRef.алк_ВТ_ДляРасчетаПоказателейПроизводства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_НормыРасходаИВыпуска/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы  

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	Если НайденыДублиНоменклатуры() Тогда   
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 	
			Отказ = Истина; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьФорму("Материалы");
	НастроитьФорму("Отходы"); 
	
	НастроитьВидимостьПечати();		
КонецПроцедуры 

&НаКлиенте
Процедура НормыМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.НормыМатериалы.ТекущиеДанные.ВидДвижения = ПредопределенноеЗначение("Перечисление.алк_ВидДвиженияНормы.Материалы");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыОтходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда 
		Элементы.НормыОтходы.ТекущиеДанные.ВидДвижения = ПредопределенноеЗначение("Перечисление.алк_ВидДвиженияНормы.Отходы");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыЛистовСорта1ПриИзменении(Элемент)
	ТекСтрока = Элементы.НормыМатериалы.ТекущиеДанные;
	Если ТекСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда    
		РасчетНормыМатериалов(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыЛистовВсего1ПриИзменении(Элемент)
	//ТекСтрока = Элементы.НормыМатериалы.ТекущиеДанные;
	//Если НЕ ТекСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда   
	//	РасчетНормыЧерезДолюЛистов(ТекСтрока);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормыКРС1ПриИзменении(Элемент)
	//ТекСтрока = Элементы.НормыМатериалы.ТекущиеДанные;
	//Если НЕ ТекСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда   
	//	РасчетНормыЧерезДолюЛистов(ТекСтрока);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	НастроитьФорму(ТекущаяСтраница.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НормыМатериалыХарактеристикаПриИзменении(Элемент)  
	ТекСтрока = Элементы.НормыМатериалы.ТекущиеДанные;
	Если ТекСтрока.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда 
		РасчетНормыМатериалов(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	Материалы = Объект.Нормы.НайтиСтроки(Новый Структура("ВидДвижения",ПредопределенноеЗначение("Перечисление.алк_ВидДвиженияНормы.Материалы")));
	
	Для Каждого стр ИЗ Материалы Цикл
		Если стр.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда
			РасчетНормыМатериалов(стр);
		КонецЕсли;
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Класс)
		ИЛИ ЗначениеЗаполнено(Объект.Марка)
		ИЛИ ЗначениеЗаполнено(Объект.МаркаАнгл)
		ИЛИ ЗначениеЗаполнено(Объект.Прочность)
		ИЛИ ЗначениеЗаполнено(Объект.КоэффициентЭффективногоПоперечногоСечения)
		ИЛИ ЗначениеЗаполнено(Объект.Адгезия)   
		ИЛИ ЗначениеЗаполнено(Объект.АдгезияАнгл) 
		ИЛИ ЗначениеЗаполнено(Объект.ЭмиссияE)
		ИЛИ ЗначениеЗаполнено(Объект.ЭмиссияF)
		ИЛИ ЗначениеЗаполнено(Объект.ЭмиссияM) Тогда  
		
		ДопПараметры = Новый Структура; 
		ДопПараметры.Вставить("ЗначениеПосле",ВыбранноеЗначение);
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаРежимаРедактирования", ЭтотОбъект,ДопПараметры);	
		ПоказатьВопрос(Оповещение,
		"Данные для печати будут очищены. Продолжить?",
		РежимДиалогаВопрос.ДаНетОтмена,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Внимание!" // (необ.) заголовок
		);  
	Иначе 	 
		Объект.Операция = ВыбранноеЗначение; 
		НастроитьВидимостьПечати();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыВспомогательные

&НаКлиенте
Процедура НастроитьФорму(ИмяВкладки)
		
	Если НЕ Объект.Нормы.Количество() = 0 Тогда
		СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидДвижения", ПредопределенноеЗначение("Перечисление.алк_ВидДвиженияНормы." + ИмяВкладки));
		Элементы["Нормы"+ИмяВкладки].ОтборСтрок = СтруктураОтбора;
	Иначе
		Элементы["Нормы"+ИмяВкладки].ОтборСтрок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура РасчетНормыМатериалов(ТекСтрока)
	  
	Если НЕ ЗначениеЗаполнено(ТекСтрока.ЛистовСорта) Тогда 
		ТекСтрока.Норма = 0;
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Характеристика) Тогда 
		ОбъемЛистаПродукции = 0;
	Иначе      
		ОбъемЛистаПродукции = ВернутьОбъемОднойШтуки(Объект.Характеристика);
	КонецЕсли;
	  
	
	Если ОбъемЛистаПродукции = 0 Тогда 
		ТекСтрока.Норма = 0;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Характеристика) Тогда 
		ОбъемЛистаМатериалов = 0;	
	Иначе 
		ОбъемЛистаМатериалов = ВернутьОбъемОднойШтуки(ТекСтрока.Характеристика); 
	КонецЕсли;
	
	ТекСтрока.Норма = ОКР(ОбъемЛистаМатериалов*ТекСтрока.ЛистовСорта/ОбъемЛистаПродукции,6); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьПечати() 	
	Если Объект.Операция = ПредопределенноеЗначение("Справочник.алк_ОперацииПроизводства.УпаковкаФанеры") Тогда 
		Элементы.ДанныеДляПечати.Видимость = Истина;
	Иначе 
		Элементы.ДанныеДляПечати.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьДанныеПечати() 	
	Объект.Класс = 0;
	Объект.Марка = "";
	Объект.МаркаАнгл = "";
	Объект.Прочность = 0;
	Объект.КоэффициентЭффективногоПоперечногоСечения = 0;
	Объект.Адгезия = "";   
	Объект.АдгезияАнгл = ""; 
	Объект.ЭмиссияE = 0;
	Объект.ЭмиссияF = 0;
	Объект.ЭмиссияM = 0; 	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОтветаРежимаРедактирования(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.Операция = ДопПараметры.ЗначениеПосле;
	НастроитьВидимостьПечати(); 
	ОчиститьДанныеПечати()
	
КонецПроцедуры

#КонецОбласти 

#Область ФункцииВспомогательные 

&НаСервере
Функция НайденыДублиНоменклатуры() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ТЧ.Номенклатура КАК Номенклатура,
	                |	ТЧ.ВидДвижения КАК ВидДвижения,
	                |	ТЧ.Характеристика КАК Характеристика
	                |ПОМЕСТИТЬ ВТ
	                |ИЗ
	                |	&ТЧ КАК ТЧ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	МестоНоменклатурыВТЧ.Номенклатура КАК Номенклатура,
	                |	МестоНоменклатурыВТЧ.Характеристика КАК Характеристика,
	                |	МестоНоменклатурыВТЧ.ВидДвижения КАК ВидДвижения,
	                |	КоличествоНоменклатур.Количество КАК Количество
	                |ИЗ
	                |	(ВЫБРАТЬ
	                |		ВТ.Номенклатура КАК Номенклатура,
	                |		КОЛИЧЕСТВО(ВТ.Номенклатура) КАК Количество,
	                |		ВТ.Характеристика КАК Характеристика
	                |	ИЗ
	                |		ВТ КАК ВТ
	                |	
	                |	СГРУППИРОВАТЬ ПО
	                |		ВТ.Номенклатура,
	                |		ВТ.Характеристика) КАК КоличествоНоменклатур
	                |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                |			ВТ.Номенклатура КАК Номенклатура,
	                |			ВТ.Характеристика КАК Характеристика,
	                |			ВТ.ВидДвижения КАК ВидДвижения
	                |		ИЗ
	                |			ВТ КАК ВТ
	                |		
	                |		СГРУППИРОВАТЬ ПО
	                |			ВТ.Номенклатура,
	                |			ВТ.Характеристика,
	                |			ВТ.ВидДвижения) КАК МестоНоменклатурыВТЧ
	                |		ПО КоличествоНоменклатур.Номенклатура = МестоНоменклатурыВТЧ.Номенклатура
	                |			И КоличествоНоменклатур.Характеристика = МестоНоменклатурыВТЧ.Характеристика
	                |ГДЕ
	                |	КоличествоНоменклатур.Количество > 1";  
	
	Запрос.УстановитьПараметр("ТЧ",Объект.Нормы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка! Найдены дубли номенклатуры!",,"Объект.Нормы");
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		Сообщить(СтрШаблон("Дубль номенклатуры: %1 во вкладке ""%2"".",Выборка.Номенклатура,Выборка.ВидДвижения));
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьОбъемОднойШтуки(Характеристика)   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ПараметрыХарактеристик.Объем КАК Объем
	               |ИЗ
	               |	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |ГДЕ
	               |	алк_ПараметрыХарактеристик.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Характеристика",Характеристика); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	ОбъемШтуки = 0;
	
	Пока Выборка.Следующий() Цикл 
		ОбъемШтуки = Выборка.Объем;
	КонецЦикла; 
	
	Возврат ОбъемШтуки; 
	
КонецФункции

#КонецОбласти
